CSI API ETABS v1

# cDCoACI318_08_IBC2009GetPreference Method

---

Retrieves the value of a concrete design preference item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetPreference(
    	int Item,
    	ref double Value
    )

    Function GetPreference (
    	Item As Integer,
    	ByRef Value As Double
    ) As Integer

    Dim instance As cDCoACI318_08_IBC2009
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.GetPreference(Item,
    	Value)

    int GetPreference(
    	int Item,
    	double% Value
    )

    abstract GetPreference :
            Item : int *
            Value : float byref -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 1 and 13, inclusive, indicating the preference item
considered.

  1. Number of interaction curves
  2. Number of interaction points
  3. Consider minimum eccentricity
  4. Seismic design category
  5. Phi tension controlled
  6. Phi compression controlled tied
  7. Phi compression controlled spiral
  8. Phi shear and/or torsion
  9. Phi shear seismic
  10. Phi joint shear
  11. Pattern live load factor
  12. Utilization factor limit
  13. Multi-response case design

Value

    Type: SystemDouble
The value of the considered preference item.

  1. Number of interaction curves

Value >= 4 and divisable by 4

  2. Number of interaction points

Value >= 5 and odd

  3. Consider minimum eccentricity

0 = No

Any other value = Yes

  4. Seismic design category
     * 1 = A
     * 2 = B
     * 3 = C
     * 4 = D
     * 5 = E
     * 6 = F
  5. Phi tension controlled

Value > 0

  6. Phi compression controlled tied

Value > 0

  7. Phi compression controlled spiral

Value > 0

  8. Phi shear and/or torsion

Value > 0

  9. Phi shear seismic

Value > 0

  10. Phi joint shear

Value > 0

  11. Pattern live load factor

Value >= 0

  12. Utilization factor limit

Value > 0

  13. Multi-response case design
     * 1 = Envelopes
     * 2 = Step-by step
     * 3 = Last step
     * 4 = Envelopes - All
     * 5 = Step-by step - All

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'create new concrete frame section property
       ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)

    'set frame section property
       ret = SapModel.FrameObj.SetSection("8", "R1")

    'set concrete design code
       ret = SapModel.DesignConcrete.SetCode("ACI 318-08/IBC 2009")

    'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis

    'start concrete design
       ret = SapModel.DesignConcrete.StartDesign()

    'get preference item
       ret = SapModel.DesignConcrete.ACI318_08_IBC2009.GetPreference(2, Value)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDCoACI318_08_IBC2009 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com